Circular loop detected during pipe sizing. The loop may be avoided by modifying segment settings in the pipe routing preference.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CircularLoopInPipeSizing { get; }
  Visual Basic
Public Shared ReadOnly Property CircularLoopInPipeSizing As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CircularLoopInPipeSizing {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PipingFailures Class
  Autodesk.Revit.DB Namespace